# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model. More improvement points for YOLOv8, please see https://github.com/iscyy/ultralyticsPro

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

  # 改进后的参数量：YOLOv8-Gather-and-Distribute summary: 410 layers, 8670160 parameters, 8670144 gradients, 20.4 GFLOPs
  
# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [512, True]]
  - [-1, 1, SPPF, [512, 5]]  # 9

# YOLOv8.0n head
head:
  - [[2, 4, 6, 9], 1, low_FAM, []] 
  - [-1, 1, low_IFM, []] 
  - [-3, 1, Conv, [512, 1, 1]] 
  - [[4, 6, -1], 1, LAF_px, [512]] 
  - [[-1, -3], 1, InjectionMultiSum_Auto_pool1, [512]] 
  - [-1, 3, C3, [512, False]]
  - [6, 1, Conv, [256, 1, 1]] 
  - [[2, 4, -1], 1, LAF_px, [256]] 
  - [[-1, -7], 1, InjectionMultiSum_Auto_pool2, [256]]
  - [-1, 3, RepBlock, [256]]
  - [[-1, -5, 9], 1, PyramidPoolAgg, [512, 2, 'torch']]
  - [-1, 1, TopBasicLayer, [512]]
  - [[-3, -7], 1, LAF_h, []]
  - [[-1, -2], 1, InjectionMultiSum_Auto_pool3, [256]]
  - [-1, 3, RepBlock, [512]]
  - [[-1, 10], 1, LAF_h, []] 
  - [[-1, -5], 1, InjectionMultiSum_Auto_pool4, [512]] 
  - [-1, 3, RepBlock, [512]]

  - [[19, 24, 27], 1, Detect, [nc]]
