# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
# [from, number, module, args]
backbone:
  [[-1, 1, ConvNeXt, [256, 0, [3, 3, 27, 3], 256]],
   [-1, 1, ConvNeXt, [512, 1, [3, 3, 27, 3], 256]],
   [-1, 1, ConvNeXt, [1024, 2, [3, 3, 27, 3], 256]],
   [-1, 1, ConvNeXt, [2048, 3, [3, 3, 27, 3], 256]],
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [2048, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],
   [-1, 3, C3, [2048, False]],

   [-1, 1, Conv, [1024, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 1], 1, Concat, [1]],
   [-1, 3, C3, [1024, False]],

   [-1, 1, Conv, [1024, 3, 2]],
   [[-1, 8], 1, Concat, [1]],
   [-1, 3, C3, [2048, False]],

   [-1, 1, Conv, [2048, 3, 2]],
   [[-1, 4], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [2048, False]],  # 23 (P5/32-large)

   [[11, 14, 17], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]

